<?php

use Illuminate\Database\Seeder;

class CitySeeder extends Seeder
{
    private $data = [
        [
            "name" => "Абакан"
        ],
        [
            "name" => "Азов"
        ],
        [
            "name" => "Александров"
        ],
        [
            "name" => "Алексин"
        ],
        [
            "name" => "Альметьевск"
        ],
        [
            "name" => "Анапа"
        ],
        [
            "name" => "Ангарск"
        ],
        [
            "name" => "Анжеро-Судженск"
        ],
        [
            "name" => "Апатиты"
        ],
        [
            "name" => "Арзамас"
        ],
        [
            "name" => "Армавир"
        ],
        [
            "name" => "Арсеньев"
        ],
        [
            "name" => "Артем"
        ],
        [
            "name" => "Архангельск"
        ],
        [
            "name" => "Асбест"
        ],
        [
            "name" => "Астрахань"
        ],
        [
            "name" => "Ачинск"
        ],
        [
            "name" => "Балаково"
        ],
        [
            "name" => "Балахна"
        ],
        [
            "name" => "Балашиха"
        ],
        [
            "name" => "Балашов"
        ],
        [
            "name" => "Барнаул"
        ],
        [
            "name" => "Батайск"
        ],
        [
            "name" => "Белгород"
        ],
        [
            "name" => "Белебей"
        ],
        [
            "name" => "Белово"
        ],
        [
            "name" => "Белогорск (Амурская область)"
        ],
        [
            "name" => "Белорецк"
        ],
        [
            "name" => "Белореченск"
        ],
        [
            "name" => "Бердск"
        ],
        [
            "name" => "Березники"
        ],
        [
            "name" => "Березовский (Свердловская область)"
        ],
        [
            "name" => "Бийск"
        ],
        [
            "name" => "Биробиджан"
        ],
        [
            "name" => "Благовещенск (Амурская область)"
        ],
        [
            "name" => "Бор"
        ],
        [
            "name" => "Борисоглебск"
        ],
        [
            "name" => "Боровичи"
        ],
        [
            "name" => "Братск"
        ],
        [
            "name" => "Брянск"
        ],
        [
            "name" => "Бугульма"
        ],
        [
            "name" => "Буденновск"
        ],
        [
            "name" => "Бузулук"
        ],
        [
            "name" => "Буйнакск"
        ],
        [
            "name" => "Великие Луки"
        ],
        [
            "name" => "Великий Новгород"
        ],
        [
            "name" => "Верхняя Пышма"
        ],
        [
            "name" => "Видное"
        ],
        [
            "name" => "Владивосток"
        ],
        [
            "name" => "Владикавказ"
        ],
        [
            "name" => "Владимир"
        ],
        [
            "name" => "Волгоград"
        ],
        [
            "name" => "Волгодонск"
        ],
        [
            "name" => "Волжск"
        ],
        [
            "name" => "Волжский"
        ],
        [
            "name" => "Вологда"
        ],
        [
            "name" => "Вольск"
        ],
        [
            "name" => "Воркута"
        ],
        [
            "name" => "Воронеж"
        ],
        [
            "name" => "Воскресенск"
        ],
        [
            "name" => "Воткинск"
        ],
        [
            "name" => "Всеволожск"
        ],
        [
            "name" => "Выборг"
        ],
        [
            "name" => "Выкса"
        ],
        [
            "name" => "Вязьма"
        ],
        [
            "name" => "Гатчина"
        ],
        [
            "name" => "Геленджик"
        ],
        [
            "name" => "Георгиевск"
        ],
        [
            "name" => "Глазов"
        ],
        [
            "name" => "Горно-Алтайск"
        ],
        [
            "name" => "Грозный"
        ],
        [
            "name" => "Губкин"
        ],
        [
            "name" => "Гудермес"
        ],
        [
            "name" => "Гуково"
        ],
        [
            "name" => "Гусь-Хрустальный"
        ],
        [
            "name" => "Дербент"
        ],
        [
            "name" => "Дзержинск"
        ],
        [
            "name" => "Димитровград"
        ],
        [
            "name" => "Дмитров"
        ],
        [
            "name" => "Долгопрудный"
        ],
        [
            "name" => "Домодедово"
        ],
        [
            "name" => "Донской"
        ],
        [
            "name" => "Дубна"
        ],
        [
            "name" => "Евпатория"
        ],
        [
            "name" => "Егорьевск"
        ],
        [
            "name" => "Ейск"
        ],
        [
            "name" => "Екатеринбург"
        ],
        [
            "name" => "Елабуга"
        ],
        [
            "name" => "Елец"
        ],
        [
            "name" => "Ессентуки"
        ],
        [
            "name" => "Железногорск (Красноярский край)"
        ],
        [
            "name" => "Железногорск (Курская область)"
        ],
        [
            "name" => "Жигулевск"
        ],
        [
            "name" => "Жуковский"
        ],
        [
            "name" => "Заречный"
        ],
        [
            "name" => "Зеленогорск"
        ],
        [
            "name" => "Зеленодольск"
        ],
        [
            "name" => "Златоуст"
        ],
        [
            "name" => "Иваново"
        ],
        [
            "name" => "Ивантеевка"
        ],
        [
            "name" => "Ижевск"
        ],
        [
            "name" => "Избербаш"
        ],
        [
            "name" => "Иркутск"
        ],
        [
            "name" => "Искитим"
        ],
        [
            "name" => "Ишим"
        ],
        [
            "name" => "Ишимбай"
        ],
        [
            "name" => "Йошкар-Ола"
        ],
        [
            "name" => "Казань"
        ],
        [
            "name" => "Калининград"
        ],
        [
            "name" => "Калуга"
        ],
        [
            "name" => "Каменск-Уральский"
        ],
        [
            "name" => "Каменск-Шахтинский"
        ],
        [
            "name" => "Камышин"
        ],
        [
            "name" => "Канск"
        ],
        [
            "name" => "Каспийск"
        ],
        [
            "name" => "Кемерово"
        ],
        [
            "name" => "Керчь"
        ],
        [
            "name" => "Кинешма"
        ],
        [
            "name" => "Кириши"
        ],
        [
            "name" => "Киров (Кировская область)"
        ],
        [
            "name" => "Кирово-Чепецк"
        ],
        [
            "name" => "Киселевск"
        ],
        [
            "name" => "Кисловодск"
        ],
        [
            "name" => "Клин"
        ],
        [
            "name" => "Клинцы"
        ],
        [
            "name" => "Ковров"
        ],
        [
            "name" => "Когалым"
        ],
        [
            "name" => "Коломна"
        ],
        [
            "name" => "Комсомольск-на-Амуре"
        ],
        [
            "name" => "Копейск"
        ],
        [
            "name" => "Королев"
        ],
        [
            "name" => "Кострома"
        ],
        [
            "name" => "Котлас"
        ],
        [
            "name" => "Красногорск"
        ],
        [
            "name" => "Краснодар"
        ],
        [
            "name" => "Краснокаменск"
        ],
        [
            "name" => "Краснокамск"
        ],
        [
            "name" => "Краснотурьинск"
        ],
        [
            "name" => "Красноярск"
        ],
        [
            "name" => "Кропоткин"
        ],
        [
            "name" => "Крымск"
        ],
        [
            "name" => "Кстово"
        ],
        [
            "name" => "Кузнецк"
        ],
        [
            "name" => "Кумертау"
        ],
        [
            "name" => "Кунгур"
        ],
        [
            "name" => "Курган"
        ],
        [
            "name" => "Курск"
        ],
        [
            "name" => "Кызыл"
        ],
        [
            "name" => "Лабинск"
        ],
        [
            "name" => "Лениногорск"
        ],
        [
            "name" => "Ленинск-Кузнецкий"
        ],
        [
            "name" => "Лесосибирск"
        ],
        [
            "name" => "Липецк"
        ],
        [
            "name" => "Лиски"
        ],
        [
            "name" => "Лобня"
        ],
        [
            "name" => "Лысьва"
        ],
        [
            "name" => "Лыткарино"
        ],
        [
            "name" => "Люберцы"
        ],
        [
            "name" => "Магадан"
        ],
        [
            "name" => "Магнитогорск"
        ],
        [
            "name" => "Майкоп"
        ],
        [
            "name" => "Махачкала"
        ],
        [
            "name" => "Междуреченск"
        ],
        [
            "name" => "Мелеуз"
        ],
        [
            "name" => "Миасс"
        ],
        [
            "name" => "Минеральные Воды"
        ],
        [
            "name" => "Минусинск"
        ],
        [
            "name" => "Михайловка"
        ],
        [
            "name" => "Михайловск (Ставропольский край)"
        ],
        [
            "name" => "Мичуринск"
        ],
        [
            "name" => "Москва"
        ],
        [
            "name" => "Мурманск"
        ],
        [
            "name" => "Муром"
        ],
        [
            "name" => "Мытищи"
        ],
        [
            "name" => "Набережные Челны"
        ],
        [
            "name" => "Назарово"
        ],
        [
            "name" => "Назрань"
        ],
        [
            "name" => "Нальчик"
        ],
        [
            "name" => "Наро-Фоминск"
        ],
        [
            "name" => "Находка"
        ],
        [
            "name" => "Невинномысск"
        ],
        [
            "name" => "Нерюнгри"
        ],
        [
            "name" => "Нефтекамск"
        ],
        [
            "name" => "Нефтеюганск"
        ],
        [
            "name" => "Нижневартовск"
        ],
        [
            "name" => "Нижнекамск"
        ],
        [
            "name" => "Нижний Новгород"
        ],
        [
            "name" => "Нижний Тагил"
        ],
        [
            "name" => "Новоалтайск"
        ],
        [
            "name" => "Новокузнецк"
        ],
        [
            "name" => "Новокуйбышевск"
        ],
        [
            "name" => "Новомосковск"
        ],
        [
            "name" => "Новороссийск"
        ],
        [
            "name" => "Новосибирск"
        ],
        [
            "name" => "Новотроицк"
        ],
        [
            "name" => "Новоуральск"
        ],
        [
            "name" => "Новочебоксарск"
        ],
        [
            "name" => "Новочеркасск"
        ],
        [
            "name" => "Новошахтинск"
        ],
        [
            "name" => "Новый Уренгой"
        ],
        [
            "name" => "Ногинск"
        ],
        [
            "name" => "Норильск"
        ],
        [
            "name" => "Ноябрьск"
        ],
        [
            "name" => "Нягань"
        ],
        [
            "name" => "Обнинск"
        ],
        [
            "name" => "Одинцово"
        ],
        [
            "name" => "Озерск (Челябинская область)"
        ],
        [
            "name" => "Октябрьский"
        ],
        [
            "name" => "Омск"
        ],
        [
            "name" => "Орел"
        ],
        [
            "name" => "Оренбург"
        ],
        [
            "name" => "Орехово-Зуево"
        ],
        [
            "name" => "Орск"
        ],
        [
            "name" => "Павлово"
        ],
        [
            "name" => "Павловский Посад"
        ],
        [
            "name" => "Пенза"
        ],
        [
            "name" => "Первоуральск"
        ],
        [
            "name" => "Пермь"
        ],
        [
            "name" => "Петрозаводск"
        ],
        [
            "name" => "Петропавловск-Камчатский"
        ],
        [
            "name" => "Подольск"
        ],
        [
            "name" => "Полевской"
        ],
        [
            "name" => "Прокопьевск"
        ],
        [
            "name" => "Прохладный"
        ],
        [
            "name" => "Псков"
        ],
        [
            "name" => "Пушкино"
        ],
        [
            "name" => "Пятигорск"
        ],
        [
            "name" => "Раменское"
        ],
        [
            "name" => "Ревда"
        ],
        [
            "name" => "Реутов"
        ],
        [
            "name" => "Ржев"
        ],
        [
            "name" => "Рославль"
        ],
        [
            "name" => "Россошь"
        ],
        [
            "name" => "Ростов-на-Дону"
        ],
        [
            "name" => "Рубцовск"
        ],
        [
            "name" => "Рыбинск"
        ],
        [
            "name" => "Рязань"
        ],
        [
            "name" => "Салават"
        ],
        [
            "name" => "Сальск"
        ],
        [
            "name" => "Самара"
        ],
        [
            "name" => "Санкт-Петербург"
        ],
        [
            "name" => "Саранск"
        ],
        [
            "name" => "Сарапул"
        ],
        [
            "name" => "Саратов"
        ],
        [
            "name" => "Саров"
        ],
        [
            "name" => "Свободный"
        ],
        [
            "name" => "Севастополь"
        ],
        [
            "name" => "Северодвинск"
        ],
        [
            "name" => "Северск"
        ],
        [
            "name" => "Сергиев Посад"
        ],
        [
            "name" => "Серов"
        ],
        [
            "name" => "Серпухов"
        ],
        [
            "name" => "Сертолово"
        ],
        [
            "name" => "Сибай"
        ],
        [
            "name" => "Симферополь"
        ],
        [
            "name" => "Славянск-на-Кубани"
        ],
        [
            "name" => "Смоленск"
        ],
        [
            "name" => "Соликамск"
        ],
        [
            "name" => "Солнечногорск"
        ],
        [
            "name" => "Сосновый Бор"
        ],
        [
            "name" => "Сочи"
        ],
        [
            "name" => "Ставрополь"
        ],
        [
            "name" => "Старый Оскол"
        ],
        [
            "name" => "Стерлитамак"
        ],
        [
            "name" => "Ступино"
        ],
        [
            "name" => "Сургут"
        ],
        [
            "name" => "Сызрань"
        ],
        [
            "name" => "Сыктывкар"
        ],
        [
            "name" => "Таганрог"
        ],
        [
            "name" => "Тамбов"
        ],
        [
            "name" => "Тверь"
        ],
        [
            "name" => "Тимашевск"
        ],
        [
            "name" => "Тихвин"
        ],
        [
            "name" => "Тихорецк"
        ],
        [
            "name" => "Тобольск"
        ],
        [
            "name" => "Тольятти"
        ],
        [
            "name" => "Томск"
        ],
        [
            "name" => "Троицк"
        ],
        [
            "name" => "Туапсе"
        ],
        [
            "name" => "Туймазы"
        ],
        [
            "name" => "Тула"
        ],
        [
            "name" => "Тюмень"
        ],
        [
            "name" => "Узловая"
        ],
        [
            "name" => "Улан-Удэ"
        ],
        [
            "name" => "Ульяновск"
        ],
        [
            "name" => "Урус-Мартан"
        ],
        [
            "name" => "Усолье-Сибирское"
        ],
        [
            "name" => "Уссурийск"
        ],
        [
            "name" => "Усть-Илимск"
        ],
        [
            "name" => "Уфа"
        ],
        [
            "name" => "Ухта"
        ],
        [
            "name" => "Феодосия"
        ],
        [
            "name" => "Фрязино"
        ],
        [
            "name" => "Хабаровск"
        ],
        [
            "name" => "Ханты-Мансийск"
        ],
        [
            "name" => "Хасавюрт"
        ],
        [
            "name" => "Химки"
        ],
        [
            "name" => "Чайковский"
        ],
        [
            "name" => "Чапаевск"
        ],
        [
            "name" => "Чебоксары"
        ],
        [
            "name" => "Челябинск"
        ],
        [
            "name" => "Черемхово"
        ],
        [
            "name" => "Череповец"
        ],
        [
            "name" => "Черкесск"
        ],
        [
            "name" => "Черногорск"
        ],
        [
            "name" => "Чехов"
        ],
        [
            "name" => "Чистополь"
        ],
        [
            "name" => "Чита"
        ],
        [
            "name" => "Шадринск"
        ],
        [
            "name" => "Шали"
        ],
        [
            "name" => "Шахты"
        ],
        [
            "name" => "Шуя"
        ],
        [
            "name" => "Щекино"
        ],
        [
            "name" => "Щелково"
        ],
        [
            "name" => "Электросталь"
        ],
        [
            "name" => "Элиста"
        ],
        [
            "name" => "Энгельс"
        ],
        [
            "name" => "Южно-Сахалинск"
        ],
        [
            "name" => "Юрга"
        ],
        [
            "name" => "Якутск"
        ],
        [
            "name" => "Ялта"
        ],
        [
            "name" => "Ярославль"
        ]
    ];

    /**
     * Run the database seeds.
     *
     * @return void
     */

    public function run()
    {
        foreach ($this->data as $item) {
            (new \App\Models\Cities($item))->save();
        }
    }
}
